testing/artillery/artillery_test_users_id_task_taskid.yml
config:
  target:  "https://nsc-func-dev-usw2-tuesday.azurewebsites.net"
  phases:
    - duration: 300
      arrivalRate: 40
      name: "Using Artillery 40 requests with cache /users/{userId}/tasks/{task_id}"
scenarios:
  - flow:
      - get:
          url: "/api/users/1/tasks/1"
          json:
            name : "name"